app/controllers/custom_controller_controller.rb

SELECT "projects".* FROM "projects"
SELECT "todos".* FROM "todos"
---
  def index
    @projects = Project.all
    @todos = Todo.all

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "is_completed" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["is_completed", "f"], ["updated_at", "2018-09-17 21:49:39.497521"], ["id", 18]]
---
  def update
    @u_todo = Todo.find(params["todo"]["id"])
    @u_todo.toggle(:is_completed)

INSERT INTO "todos" ("text", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "fffff"], ["project_id", 1], ["created_at", "2018-09-15 15:52:16.985463"], ["updated_at", "2018-09-15 15:52:16.985463"]]
---
  def create
    # if params['text'] != '' || params['project_id'] != -1
    Todo.create(text: params['todo']['text'], project_id: params['todo']['project_id'])